uhnp/src/InformationRegisters/тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений/тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений</name>
  <comment>//Ведутенко С.А. от 18.04.2023 Выполнение задач №000045214</comment>
  <resources>
    <name>НаЧтоЗаменять</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОшибки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЧтоЗаменять</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_НастройкаАвтоматическогоПоискаИЗаменыЗначений/тн_НастройкаАвтоматическогоПоискаИЗаменыЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_НастройкаАвтоматическогоПоискаИЗаменыЗначений</name>
  <comment>//Ведутенко С.А. от 18.04.2023 Выполнение задач №000045214</comment>
  <resources>
    <name>КоличествоОбъектовВВыборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьЗаменыБезТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалятьФизическиЗамененныеЭлементы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалятьРегистрациюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДнейНаРазборОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РеквизитыПоискаДублей</name>
    <comment>//Ведутенко С.А. от 28.09.2023 Выполнение задач №000047019</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоФоновыхЗаданий</name>
    <comment>//Ведутенко С.А. от 28.09.2023 Выполнение задач №000047019</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ОтветственныеЛица</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключаемыеРегистрыСведений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяОбработкаЗамен</name>
    <comment>//Ведутенко С.А. от 28.09.2023 Выполнение задач №000047019</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыПроверкиЗамен</name>
    <comment>//Сафиуллина З.Р. 27.03.2026 Выполнение задач №000057186</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс 

Процедура СброситьЗависшиеОшибки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкаАвтоматическогоПоискаИЗаменыЗначений.ТипОбъекта КАК ТипОбъекта,
		|	НастройкаАвтоматическогоПоискаИЗаменыЗначений.ДнейНаРазборОшибки КАК ДнейНаРазборОшибки
		|ИЗ
	
		//НАЧАЛО Ведутенко С.А. 29.09.2023 Выполнение задач №000047019
		
		//|	РегистрСведений.тн_НастройкаАвтоматическогоПоискаИЗаменыЗначений КАК НастройкаАвтоматическогоПоискаИЗаменыЗначений";
		
		|	РегистрСведений.тн_НастройкаАвтоматическогоПоискаИЗаменыЗначений КАК НастройкаАвтоматическогоПоискаИЗаменыЗначений
		|ГДЕ
		|	НЕ НастройкаАвтоматическогоПоискаИЗаменыЗначений.ТиповаяОбработкаЗамен";	
		
		//КОНЕЦ  Ведутенко С.А. 29.09.2023 Выполнение задач №000047019
	
	РезультатЗапроса = Запрос.Выполнить();	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаНастройки = РезультатЗапроса.Выбрать();
	
	Сч = 0;
	Запрос.Текст = "";
	Пока ВыборкаНастройки.Следующий() Цикл
		
		Сч = Сч + 1;
		
		Если Сч > 1 Тогда
			Запрос.Текст = Запрос.Текст + " ОБЪЕДИНИТЬ ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + 
			"
			|ВЫБРАТЬ
			|	Ошибки.ЧтоЗаменять КАК ЧтоЗаменять,
			|	Ошибки.УникальныйИдентификатор КАК УникальныйИдентификатор
			|ИЗ
			|	РегистрСведений.тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений КАК Ошибки
			|ГДЕ
			|	Ошибки.ЧтоЗаменять Ссылка //ПолноеИмяТипа
			|	И Ошибки.ДатаОшибки <> ДАТАВРЕМЯ(1, 1, 1)
			|	И Ошибки.ДатаОшибки < &ГраницаЗависшихОшибок" + Сч;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ПолноеИмяТипа", ВыборкаНастройки.ТипОбъекта);
	    Запрос.УстановитьПараметр("ГраницаЗависшихОшибок" + Сч, ТекущаяДатаСеанса() - ВыборкаНастройки.ДнейНаРазборОшибки * 24 * 60 * 60);
	
	КонецЦикла;
	
	//Запрос.Текст = ОбщегоНазначения.СделатьЗапросРазрешенным(Запрос.Текст);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  		
		
		МенеджерЗаписи = РегистрыСведений.тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЧтоЗаменять = ВыборкаДетальныеЗаписи.ЧтоЗаменять;
		МенеджерЗаписи.УникальныйИдентификатор = ВыборкаДетальныеЗаписи.УникальныйИдентификатор;
		МенеджерЗаписи.Удалить();
	
	КонецЦикла; 	
			
КонецПроцедуры // СброситьЗависшиеОшибки()

Процедура ЗаписатьОшибку(ЧтоЗаменять, НаЧтоЗаменять, Данные, ОписаниеОшибки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.тн_ОшибкиАвтоматическогоПоискаИЗаменыЗначений.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ЧтоЗаменять 					= ЧтоЗаменять;
	МенеджерЗаписи.УникальныйИдентификатор 		= Строка(Новый УникальныйИдентификатор);
	МенеджерЗаписи.НаЧтоЗаменять 				= НаЧтоЗаменять;
	МенеджерЗаписи.Данные 						= Данные;
	МенеджерЗаписи.ДатаОшибки 					= ТекущаяДатаСеанса();
	МенеджерЗаписи.ОписаниеОшибки 				= ОписаниеОшибки;
	
	МенеджерЗаписи.Записать();
		
КонецПроцедуры // ЗаписатьОшибку()

#КонецОбласти

#КонецЕсли
